###############################################################################
# Created by write_sdc
###############################################################################
current_design ALU
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 20.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_a[0]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_a[10]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_a[11]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_a[12]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_a[13]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_a[14]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_a[15]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_a[16]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_a[17]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_a[18]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_a[19]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_a[1]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_a[20]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_a[21]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_a[22]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_a[23]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_a[24]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_a[25]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_a[26]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_a[27]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_a[28]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_a[29]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_a[2]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_a[30]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_a[31]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_a[3]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_a[4]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_a[5]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_a[6]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_a[7]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_a[8]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_a[9]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_b[0]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_b[10]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_b[11]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_b[12]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_b[13]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_b[14]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_b[15]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_b[16]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_b[17]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_b[18]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_b[19]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_b[1]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_b[20]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_b[21]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_b[22]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_b[23]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_b[24]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_b[25]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_b[26]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_b[27]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_b[28]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_b[29]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_b[2]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_b[30]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_b[31]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_b[3]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_b[4]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_b[5]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_b[6]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_b[7]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_b[8]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_b[9]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_vld}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {opcode}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rst}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {o_res[0]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {o_res[10]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {o_res[11]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {o_res[12]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {o_res[13]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {o_res[14]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {o_res[15]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {o_res[16]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {o_res[17]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {o_res[18]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {o_res[19]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {o_res[1]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {o_res[20]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {o_res[21]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {o_res[22]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {o_res[23]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {o_res[24]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {o_res[25]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {o_res[26]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {o_res[27]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {o_res[28]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {o_res[29]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {o_res[2]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {o_res[30]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {o_res[31]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {o_res[3]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {o_res[4]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {o_res[5]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {o_res[6]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {o_res[7]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {o_res[8]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {o_res[9]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {o_res_vld}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {overflow}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {o_res_vld}]
set_load -pin_load 0.0334 [get_ports {overflow}]
set_load -pin_load 0.0334 [get_ports {o_res[31]}]
set_load -pin_load 0.0334 [get_ports {o_res[30]}]
set_load -pin_load 0.0334 [get_ports {o_res[29]}]
set_load -pin_load 0.0334 [get_ports {o_res[28]}]
set_load -pin_load 0.0334 [get_ports {o_res[27]}]
set_load -pin_load 0.0334 [get_ports {o_res[26]}]
set_load -pin_load 0.0334 [get_ports {o_res[25]}]
set_load -pin_load 0.0334 [get_ports {o_res[24]}]
set_load -pin_load 0.0334 [get_ports {o_res[23]}]
set_load -pin_load 0.0334 [get_ports {o_res[22]}]
set_load -pin_load 0.0334 [get_ports {o_res[21]}]
set_load -pin_load 0.0334 [get_ports {o_res[20]}]
set_load -pin_load 0.0334 [get_ports {o_res[19]}]
set_load -pin_load 0.0334 [get_ports {o_res[18]}]
set_load -pin_load 0.0334 [get_ports {o_res[17]}]
set_load -pin_load 0.0334 [get_ports {o_res[16]}]
set_load -pin_load 0.0334 [get_ports {o_res[15]}]
set_load -pin_load 0.0334 [get_ports {o_res[14]}]
set_load -pin_load 0.0334 [get_ports {o_res[13]}]
set_load -pin_load 0.0334 [get_ports {o_res[12]}]
set_load -pin_load 0.0334 [get_ports {o_res[11]}]
set_load -pin_load 0.0334 [get_ports {o_res[10]}]
set_load -pin_load 0.0334 [get_ports {o_res[9]}]
set_load -pin_load 0.0334 [get_ports {o_res[8]}]
set_load -pin_load 0.0334 [get_ports {o_res[7]}]
set_load -pin_load 0.0334 [get_ports {o_res[6]}]
set_load -pin_load 0.0334 [get_ports {o_res[5]}]
set_load -pin_load 0.0334 [get_ports {o_res[4]}]
set_load -pin_load 0.0334 [get_ports {o_res[3]}]
set_load -pin_load 0.0334 [get_ports {o_res[2]}]
set_load -pin_load 0.0334 [get_ports {o_res[1]}]
set_load -pin_load 0.0334 [get_ports {o_res[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_vld}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {opcode}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rst}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_a[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_a[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_a[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_a[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_a[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_a[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_a[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_a[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_a[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_a[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_a[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_a[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_a[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_a[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_a[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_a[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_a[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_a[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_a[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_a[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_a[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_a[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_a[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_a[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_a[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_a[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_a[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_a[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_a[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_a[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_a[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_a[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_b[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_b[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_b[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_b[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_b[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_b[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_b[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_b[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_b[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_b[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_b[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_b[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_b[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_b[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_b[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_b[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_b[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_b[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_b[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_b[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_b[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_b[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_b[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_b[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_b[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_b[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_b[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_b[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_b[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_b[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_b[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_b[0]}]
###############################################################################
# Design Rules
###############################################################################
set_max_transition 0.7500 [current_design]
set_max_capacitance 0.2000 [current_design]
set_max_fanout 10.0000 [current_design]
